package lab7;
/*
Выполнить задание с книги на с 194:
на оценку 3 - вариант А.
на оценку 4 - вариант В и С.
Вариант A
2. В тексте каждую букву заменить ее порядковым номером в алфавите. При выводе в одной строке печатать текст с двумя пробелами между буквами, в следующей строке внизу под каждой буквой печатать ее номер.
Вариант B
Создать программу обработки текста учебника по программированию с ис- пользованием классов: Символ, Слово, Предложение, Абзац, Лексема, Листинг, Знак препинания и др. Во всех задачах с формированием текста заменять табу- ляции и последовательности пробелов одним пробелом.
Предварительно текст следует разобрать на составные части, выполнить одно из перечисленных ниже заданий и вывести полученный результат.
2.Вывести все предложения заданного текста в порядке возрастания количест-
ва слов в каждом из них.
Вариант C
1. Текст из n2 символов шифруется по следующему правилу:
— все символы текста записываются в квадратную таблицу размерно-
сти n в порядке слева направо, сверху вниз;
— таблица поворачивается на 90° по часовой стрелке;
— 1-я строка таблицы меняется местами с последней, 2-я — с предпо- следней и т. д.
— 1-й столбец таблицы меняется местами со 2-м, 3-й — с 4-м и т. д.
— зашифрованный текст получается в результате обхода результирую- щей таблицы по спирали по часовой стрелке, начиная с левого верхнего угла.
2. Исключить из текста подстроку максимальной длины, начинающуюся и за- канчивающуюся одним и тем же символом.
* */
public class Lab7App {
}
