package lab4.vara;
/*Вариант A
Создать приложение, удовлетворяющее требованиям,
приведенным в зада- нии. Наследование применять
только в тех заданиях, в которых это логически обосновано.
Аргументировать принадлежность классу каждого создаваемого
метода и корректно переопределить для каждого класса методы
equals(), hashCode(), toString().
2. Создать объект класса Автомобиль,
 используя классы Колесо, Двигатель.
 Методы: ехать, заправляться, менять колесо,
вывести на консоль марку ав-
томобиля.
*/
public class Auto {
}
